Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/ptc.h
/*
 * Component description for PTC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2024-11-05T16:47:53Z  */
#ifndef _PIC32CMSG00_PTC_COMPONENT_H_
#define _PIC32CMSG00_PTC_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PTC                       */
/* ************************************************************************** */

/* -------- PTC_CTRLA : (PTC Offset: 0x00) (R/W 32) CONTROL ENABLE REGISTER -------- */
#define PTC_CTRLA_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLA) CONTROL ENABLE REGISTER  Reset Value */

#define PTC_CTRLA_SWRST_Pos                   _UINT32_(0)                                          /* (PTC_CTRLA) Software Reset for this macro. Position */
#define PTC_CTRLA_SWRST_Msk                   (_UINT32_(0x1) << PTC_CTRLA_SWRST_Pos)               /* (PTC_CTRLA) Software Reset for this macro. Mask */
#define PTC_CTRLA_SWRST(value)                (PTC_CTRLA_SWRST_Msk & (_UINT32_(value) << PTC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the PTC_CTRLA register */
#define   PTC_CTRLA_SWRST_0_Val               _UINT32_(0x0)                                        /* (PTC_CTRLA) There is no reset operation ongoing  */
#define   PTC_CTRLA_SWRST_1_Val               _UINT32_(0x1)                                        /* (PTC_CTRLA) The reset operation is ongoing  */
#define PTC_CTRLA_SWRST_0                     (PTC_CTRLA_SWRST_0_Val << PTC_CTRLA_SWRST_Pos)       /* (PTC_CTRLA) There is no reset operation ongoing Position */
#define PTC_CTRLA_SWRST_1                     (PTC_CTRLA_SWRST_1_Val << PTC_CTRLA_SWRST_Pos)       /* (PTC_CTRLA) The reset operation is ongoing Position */
#define PTC_CTRLA_ENABLE_Pos                  _UINT32_(1)                                          /* (PTC_CTRLA) PTC -- Enable Position */
#define PTC_CTRLA_ENABLE_Msk                  (_UINT32_(0x1) << PTC_CTRLA_ENABLE_Pos)              /* (PTC_CTRLA) PTC -- Enable Mask */
#define PTC_CTRLA_ENABLE(value)               (PTC_CTRLA_ENABLE_Msk & (_UINT32_(value) << PTC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the PTC_CTRLA register */
#define   PTC_CTRLA_ENABLE_0_Val              _UINT32_(0x0)                                        /* (PTC_CTRLA) Disable module. System clock is only requested for bus transactions. GCLK is never requested.  */
#define   PTC_CTRLA_ENABLE_1_Val              _UINT32_(0x1)                                        /* (PTC_CTRLA) Enable module by allowing both the generic clock and system clock requests based on the incoming clock requests from the SIB.  */
#define PTC_CTRLA_ENABLE_0                    (PTC_CTRLA_ENABLE_0_Val << PTC_CTRLA_ENABLE_Pos)     /* (PTC_CTRLA) Disable module. System clock is only requested for bus transactions. GCLK is never requested. Position */
#define PTC_CTRLA_ENABLE_1                    (PTC_CTRLA_ENABLE_1_Val << PTC_CTRLA_ENABLE_Pos)     /* (PTC_CTRLA) Enable module by allowing both the generic clock and system clock requests based on the incoming clock requests from the SIB. Position */
#define PTC_CTRLA_PRIV_Pos                    _UINT32_(2)                                          /* (PTC_CTRLA) Privileged Access Only -- provides filtering of privilege/non-privilege bus accesses to SFR registers Position */
#define PTC_CTRLA_PRIV_Msk                    (_UINT32_(0x1) << PTC_CTRLA_PRIV_Pos)                /* (PTC_CTRLA) Privileged Access Only -- provides filtering of privilege/non-privilege bus accesses to SFR registers Mask */
#define PTC_CTRLA_PRIV(value)                 (PTC_CTRLA_PRIV_Msk & (_UINT32_(value) << PTC_CTRLA_PRIV_Pos)) /* Assignment of value for PRIV in the PTC_CTRLA register */
#define PTC_CTRLA_RUNSTDBY_Pos                _UINT32_(6)                                          /* (PTC_CTRLA) Run In Standby Position */
#define PTC_CTRLA_RUNSTDBY_Msk                (_UINT32_(0x1) << PTC_CTRLA_RUNSTDBY_Pos)            /* (PTC_CTRLA) Run In Standby Mask */
#define PTC_CTRLA_RUNSTDBY(value)             (PTC_CTRLA_RUNSTDBY_Msk & (_UINT32_(value) << PTC_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the PTC_CTRLA register */
#define PTC_CTRLA_ONDEMAND_Pos                _UINT32_(7)                                          /* (PTC_CTRLA) On Demand Control Position */
#define PTC_CTRLA_ONDEMAND_Msk                (_UINT32_(0x1) << PTC_CTRLA_ONDEMAND_Pos)            /* (PTC_CTRLA) On Demand Control Mask */
#define PTC_CTRLA_ONDEMAND(value)             (PTC_CTRLA_ONDEMAND_Msk & (_UINT32_(value) << PTC_CTRLA_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the PTC_CTRLA register */
#define PTC_CTRLA_Msk                         _UINT32_(0x000000C7)                                 /* (PTC_CTRLA) Register Mask  */


/* -------- PTC_EVCTRL : (PTC Offset: 0x04) (R/W 32) EVENT CONTROL REGISTER -------- */
#define PTC_EVCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_EVCTRL) EVENT CONTROL REGISTER  Reset Value */

#define PTC_EVCTRL_STCONVEI_Pos               _UINT32_(0)                                          /* (PTC_EVCTRL) Start Conversion Event Input Enable Position */
#define PTC_EVCTRL_STCONVEI_Msk               (_UINT32_(0x1) << PTC_EVCTRL_STCONVEI_Pos)           /* (PTC_EVCTRL) Start Conversion Event Input Enable Mask */
#define PTC_EVCTRL_STCONVEI(value)            (PTC_EVCTRL_STCONVEI_Msk & (_UINT32_(value) << PTC_EVCTRL_STCONVEI_Pos)) /* Assignment of value for STCONVEI in the PTC_EVCTRL register */
#define PTC_EVCTRL_DSEQREI_Pos                _UINT32_(1)                                          /* (PTC_EVCTRL) DMA Sequencing Restart Event Input Enable Position */
#define PTC_EVCTRL_DSEQREI_Msk                (_UINT32_(0x1) << PTC_EVCTRL_DSEQREI_Pos)            /* (PTC_EVCTRL) DMA Sequencing Restart Event Input Enable Mask */
#define PTC_EVCTRL_DSEQREI(value)             (PTC_EVCTRL_DSEQREI_Msk & (_UINT32_(value) << PTC_EVCTRL_DSEQREI_Pos)) /* Assignment of value for DSEQREI in the PTC_EVCTRL register */
#define PTC_EVCTRL_STCONVINV_Pos              _UINT32_(2)                                          /* (PTC_EVCTRL) Start Conversion Event Invert Enable Position */
#define PTC_EVCTRL_STCONVINV_Msk              (_UINT32_(0x1) << PTC_EVCTRL_STCONVINV_Pos)          /* (PTC_EVCTRL) Start Conversion Event Invert Enable Mask */
#define PTC_EVCTRL_STCONVINV(value)           (PTC_EVCTRL_STCONVINV_Msk & (_UINT32_(value) << PTC_EVCTRL_STCONVINV_Pos)) /* Assignment of value for STCONVINV in the PTC_EVCTRL register */
#define PTC_EVCTRL_DSEQRINV_Pos               _UINT32_(3)                                          /* (PTC_EVCTRL) DMA Sequencing Restart Event Invert Enable Position */
#define PTC_EVCTRL_DSEQRINV_Msk               (_UINT32_(0x1) << PTC_EVCTRL_DSEQRINV_Pos)           /* (PTC_EVCTRL) DMA Sequencing Restart Event Invert Enable Mask */
#define PTC_EVCTRL_DSEQRINV(value)            (PTC_EVCTRL_DSEQRINV_Msk & (_UINT32_(value) << PTC_EVCTRL_DSEQRINV_Pos)) /* Assignment of value for DSEQRINV in the PTC_EVCTRL register */
#define PTC_EVCTRL_EOCEO_Pos                  _UINT32_(4)                                          /* (PTC_EVCTRL) End of Conversion Event Output Enable Position */
#define PTC_EVCTRL_EOCEO_Msk                  (_UINT32_(0x1) << PTC_EVCTRL_EOCEO_Pos)              /* (PTC_EVCTRL) End of Conversion Event Output Enable Mask */
#define PTC_EVCTRL_EOCEO(value)               (PTC_EVCTRL_EOCEO_Msk & (_UINT32_(value) << PTC_EVCTRL_EOCEO_Pos)) /* Assignment of value for EOCEO in the PTC_EVCTRL register */
#define PTC_EVCTRL_WCOMPEO_Pos                _UINT32_(5)                                          /* (PTC_EVCTRL) Window Comparator Event Output Enable Position */
#define PTC_EVCTRL_WCOMPEO_Msk                (_UINT32_(0x1) << PTC_EVCTRL_WCOMPEO_Pos)            /* (PTC_EVCTRL) Window Comparator Event Output Enable Mask */
#define PTC_EVCTRL_WCOMPEO(value)             (PTC_EVCTRL_WCOMPEO_Msk & (_UINT32_(value) << PTC_EVCTRL_WCOMPEO_Pos)) /* Assignment of value for WCOMPEO in the PTC_EVCTRL register */
#define PTC_EVCTRL_Msk                        _UINT32_(0x0000003F)                                 /* (PTC_EVCTRL) Register Mask  */


/* -------- PTC_DBGCTRL : (PTC Offset: 0x08) (R/W 32) DEBUG CONTROL Register -------- */
#define PTC_DBGCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (PTC_DBGCTRL) DEBUG CONTROL Register  Reset Value */

#define PTC_DBGCTRL_DBGRUN_Pos                _UINT32_(0)                                          /* (PTC_DBGCTRL) Debug Run Position */
#define PTC_DBGCTRL_DBGRUN_Msk                (_UINT32_(0x1) << PTC_DBGCTRL_DBGRUN_Pos)            /* (PTC_DBGCTRL) Debug Run Mask */
#define PTC_DBGCTRL_DBGRUN(value)             (PTC_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << PTC_DBGCTRL_DBGRUN_Pos)) /* Assignment of value for DBGRUN in the PTC_DBGCTRL register */
#define PTC_DBGCTRL_Msk                       _UINT32_(0x00000001)                                 /* (PTC_DBGCTRL) Register Mask  */


