Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/ptc.h
/* -------- PTC_CTRLB : (PTC Offset: 0x0C) (R/W 32) CONTROL B Register -------- */
#define PTC_CTRLB_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLB) CONTROL B Register  Reset Value */

#define PTC_CTRLB_CTSM_Pos                    _UINT32_(0)                                          /* (PTC_CTRLB) Capacitive Touch Sensing Mode Position */
#define PTC_CTRLB_CTSM_Msk                    (_UINT32_(0x7) << PTC_CTRLB_CTSM_Pos)                /* (PTC_CTRLB) Capacitive Touch Sensing Mode Mask */
#define PTC_CTRLB_CTSM(value)                 (PTC_CTRLB_CTSM_Msk & (_UINT32_(value) << PTC_CTRLB_CTSM_Pos)) /* Assignment of value for CTSM in the PTC_CTRLB register */
#define PTC_CTRLB_INTSEL_Pos                  _UINT32_(4)                                          /* (PTC_CTRLB) Interrupt Selection Position */
#define PTC_CTRLB_INTSEL_Msk                  (_UINT32_(0x1) << PTC_CTRLB_INTSEL_Pos)              /* (PTC_CTRLB) Interrupt Selection Mask */
#define PTC_CTRLB_INTSEL(value)               (PTC_CTRLB_INTSEL_Msk & (_UINT32_(value) << PTC_CTRLB_INTSEL_Pos)) /* Assignment of value for INTSEL in the PTC_CTRLB register */
#define PTC_CTRLB_SDS_Pos                     _UINT32_(8)                                          /* (PTC_CTRLB) Sampling Delay Selection. Position */
#define PTC_CTRLB_SDS_Msk                     (_UINT32_(0xF) << PTC_CTRLB_SDS_Pos)                 /* (PTC_CTRLB) Sampling Delay Selection. Mask */
#define PTC_CTRLB_SDS(value)                  (PTC_CTRLB_SDS_Msk & (_UINT32_(value) << PTC_CTRLB_SDS_Pos)) /* Assignment of value for SDS in the PTC_CTRLB register */
#define PTC_CTRLB_ASDV_Pos                    _UINT32_(12)                                         /* (PTC_CTRLB) Automatic Sampling Delay Variation. Position */
#define PTC_CTRLB_ASDV_Msk                    (_UINT32_(0x1) << PTC_CTRLB_ASDV_Pos)                /* (PTC_CTRLB) Automatic Sampling Delay Variation. Mask */
#define PTC_CTRLB_ASDV(value)                 (PTC_CTRLB_ASDV_Msk & (_UINT32_(value) << PTC_CTRLB_ASDV_Pos)) /* Assignment of value for ASDV in the PTC_CTRLB register */
#define PTC_CTRLB_CCDS_Pos                    _UINT32_(13)                                         /* (PTC_CTRLB) Channel Change Delay Selection Position */
#define PTC_CTRLB_CCDS_Msk                    (_UINT32_(0x3) << PTC_CTRLB_CCDS_Pos)                /* (PTC_CTRLB) Channel Change Delay Selection Mask */
#define PTC_CTRLB_CCDS(value)                 (PTC_CTRLB_CCDS_Msk & (_UINT32_(value) << PTC_CTRLB_CCDS_Pos)) /* Assignment of value for CCDS in the PTC_CTRLB register */
#define PTC_CTRLB_RSEL_Pos                    _UINT32_(20)                                         /* (PTC_CTRLB) Resistor Selection Position */
#define PTC_CTRLB_RSEL_Msk                    (_UINT32_(0x7) << PTC_CTRLB_RSEL_Pos)                /* (PTC_CTRLB) Resistor Selection Mask */
#define PTC_CTRLB_RSEL(value)                 (PTC_CTRLB_RSEL_Msk & (_UINT32_(value) << PTC_CTRLB_RSEL_Pos)) /* Assignment of value for RSEL in the PTC_CTRLB register */
#define PTC_CTRLB_Msk                         _UINT32_(0x00707F17)                                 /* (PTC_CTRLB) Register Mask  */


/* -------- PTC_CTRLC : (PTC Offset: 0x10) (R/W 32) CONTROL C Register -------- */
#define PTC_CTRLC_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLC) CONTROL C Register  Reset Value */

#define PTC_CTRLC_CCF_Pos                     _UINT32_(0)                                          /* (PTC_CTRLC) Compensation Capacitor Fine Value Position */
#define PTC_CTRLC_CCF_Msk                     (_UINT32_(0x1F) << PTC_CTRLC_CCF_Pos)                /* (PTC_CTRLC) Compensation Capacitor Fine Value Mask */
#define PTC_CTRLC_CCF(value)                  (PTC_CTRLC_CCF_Msk & (_UINT32_(value) << PTC_CTRLC_CCF_Pos)) /* Assignment of value for CCF in the PTC_CTRLC register */
#define PTC_CTRLC_CCC_Pos                     _UINT32_(8)                                          /* (PTC_CTRLC) Compensation Capacitor Coarse Value Position */
#define PTC_CTRLC_CCC_Msk                     (_UINT32_(0x1F) << PTC_CTRLC_CCC_Pos)                /* (PTC_CTRLC) Compensation Capacitor Coarse Value Mask */
#define PTC_CTRLC_CCC(value)                  (PTC_CTRLC_CCC_Msk & (_UINT32_(value) << PTC_CTRLC_CCC_Pos)) /* Assignment of value for CCC in the PTC_CTRLC register */
#define PTC_CTRLC_CI_Pos                      _UINT32_(16)                                         /* (PTC_CTRLC) Integration Capacitor Value Position */
#define PTC_CTRLC_CI_Msk                      (_UINT32_(0x1F) << PTC_CTRLC_CI_Pos)                 /* (PTC_CTRLC) Integration Capacitor Value Mask */
#define PTC_CTRLC_CI(value)                   (PTC_CTRLC_CI_Msk & (_UINT32_(value) << PTC_CTRLC_CI_Pos)) /* Assignment of value for CI in the PTC_CTRLC register */
#define PTC_CTRLC_CSD_Pos                     _UINT32_(24)                                         /* (PTC_CTRLC) Charge Share Delay Value Position */
#define PTC_CTRLC_CSD_Msk                     (_UINT32_(0xFF) << PTC_CTRLC_CSD_Pos)                /* (PTC_CTRLC) Charge Share Delay Value Mask */
#define PTC_CTRLC_CSD(value)                  (PTC_CTRLC_CSD_Msk & (_UINT32_(value) << PTC_CTRLC_CSD_Pos)) /* Assignment of value for CSD in the PTC_CTRLC register */
#define PTC_CTRLC_Msk                         _UINT32_(0xFF1F1F1F)                                 /* (PTC_CTRLC) Register Mask  */


/* -------- PTC_CTRLD : (PTC Offset: 0x14) (R/W 32) CONTROL D Register -------- */
#define PTC_CTRLD_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLD) CONTROL D Register  Reset Value */

#define PTC_CTRLD_DAN_Pos                     _UINT32_(0)                                          /* (PTC_CTRLD) Digital Accumulation Number Position */
#define PTC_CTRLD_DAN_Msk                     (_UINT32_(0x7) << PTC_CTRLD_DAN_Pos)                 /* (PTC_CTRLD) Digital Accumulation Number Mask */
#define PTC_CTRLD_DAN(value)                  (PTC_CTRLD_DAN_Msk & (_UINT32_(value) << PTC_CTRLD_DAN_Pos)) /* Assignment of value for DAN in the PTC_CTRLD register */
#define PTC_CTRLD_AAN_Pos                     _UINT32_(8)                                          /* (PTC_CTRLD) Analog Accumulation Number Position */
#define PTC_CTRLD_AAN_Msk                     (_UINT32_(0xF) << PTC_CTRLD_AAN_Pos)                 /* (PTC_CTRLD) Analog Accumulation Number Mask */
#define PTC_CTRLD_AAN(value)                  (PTC_CTRLD_AAN_Msk & (_UINT32_(value) << PTC_CTRLD_AAN_Pos)) /* Assignment of value for AAN in the PTC_CTRLD register */
#define PTC_CTRLD_WINCM_Pos                   _UINT32_(16)                                         /* (PTC_CTRLD) Window Comparator Mode Position */
#define PTC_CTRLD_WINCM_Msk                   (_UINT32_(0x7) << PTC_CTRLD_WINCM_Pos)               /* (PTC_CTRLD) Window Comparator Mode Mask */
#define PTC_CTRLD_WINCM(value)                (PTC_CTRLD_WINCM_Msk & (_UINT32_(value) << PTC_CTRLD_WINCM_Pos)) /* Assignment of value for WINCM in the PTC_CTRLD register */
#define PTC_CTRLD_WINSS_Pos                   _UINT32_(19)                                         /* (PTC_CTRLD) Window Single Sample Position */
#define PTC_CTRLD_WINSS_Msk                   (_UINT32_(0x1) << PTC_CTRLD_WINSS_Pos)               /* (PTC_CTRLD) Window Single Sample Mask */
#define PTC_CTRLD_WINSS(value)                (PTC_CTRLD_WINSS_Msk & (_UINT32_(value) << PTC_CTRLD_WINSS_Pos)) /* Assignment of value for WINSS in the PTC_CTRLD register */
#define PTC_CTRLD_EXTCIEN_Pos                 _UINT32_(20)                                         /* (PTC_CTRLD) External Integration Capacitor Enable Position */
#define PTC_CTRLD_EXTCIEN_Msk                 (_UINT32_(0x3) << PTC_CTRLD_EXTCIEN_Pos)             /* (PTC_CTRLD) External Integration Capacitor Enable Mask */
#define PTC_CTRLD_EXTCIEN(value)              (PTC_CTRLD_EXTCIEN_Msk & (_UINT32_(value) << PTC_CTRLD_EXTCIEN_Pos)) /* Assignment of value for EXTCIEN in the PTC_CTRLD register */
#define PTC_CTRLD_POLICC_Pos                  _UINT32_(23)                                         /* (PTC_CTRLD) Polarity of Internal Compensation Capacitor Position */
#define PTC_CTRLD_POLICC_Msk                  (_UINT32_(0x1) << PTC_CTRLD_POLICC_Pos)              /* (PTC_CTRLD) Polarity of Internal Compensation Capacitor Mask */
#define PTC_CTRLD_POLICC(value)               (PTC_CTRLD_POLICC_Msk & (_UINT32_(value) << PTC_CTRLD_POLICC_Pos)) /* Assignment of value for POLICC in the PTC_CTRLD register */
#define PTC_CTRLD_DSEN_Pos                    _UINT32_(24)                                         /* (PTC_CTRLD) DSEN Driven Shield Enable. Position */
#define PTC_CTRLD_DSEN_Msk                    (_UINT32_(0x1) << PTC_CTRLD_DSEN_Pos)                /* (PTC_CTRLD) DSEN Driven Shield Enable. Mask */
#define PTC_CTRLD_DSEN(value)                 (PTC_CTRLD_DSEN_Msk & (_UINT32_(value) << PTC_CTRLD_DSEN_Pos)) /* Assignment of value for DSEN in the PTC_CTRLD register */
#define PTC_CTRLD_DSEQSTOP_Pos                _UINT32_(31)                                         /* (PTC_CTRLD) Stop DMA Sequence Position */
#define PTC_CTRLD_DSEQSTOP_Msk                (_UINT32_(0x1) << PTC_CTRLD_DSEQSTOP_Pos)            /* (PTC_CTRLD) Stop DMA Sequence Mask */
#define PTC_CTRLD_DSEQSTOP(value)             (PTC_CTRLD_DSEQSTOP_Msk & (_UINT32_(value) << PTC_CTRLD_DSEQSTOP_Pos)) /* Assignment of value for DSEQSTOP in the PTC_CTRLD register */
#define PTC_CTRLD_Msk                         _UINT32_(0x81BF0F07)                                 /* (PTC_CTRLD) Register Mask  */


/* -------- PTC_CTRLE : (PTC Offset: 0x18) (R/W 32) CONTROL E REGISTER -------- */
#define PTC_CTRLE_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_CTRLE) CONTROL E REGISTER  Reset Value */

#define PTC_CTRLE_AIPMPEN_Pos                 _UINT32_(4)                                          /* (PTC_CTRLE) Analog Input Charge Pump Enable Position */
#define PTC_CTRLE_AIPMPEN_Msk                 (_UINT32_(0x1) << PTC_CTRLE_AIPMPEN_Pos)             /* (PTC_CTRLE) Analog Input Charge Pump Enable Mask */
#define PTC_CTRLE_AIPMPEN(value)              (PTC_CTRLE_AIPMPEN_Msk & (_UINT32_(value) << PTC_CTRLE_AIPMPEN_Pos)) /* Assignment of value for AIPMPEN in the PTC_CTRLE register */
#define PTC_CTRLE_PRSC_Pos                    _UINT32_(8)                                          /* (PTC_CTRLE) This field defines the PTC clock relative to the peripheral clock according to the table below. Position */
#define PTC_CTRLE_PRSC_Msk                    (_UINT32_(0x7) << PTC_CTRLE_PRSC_Pos)                /* (PTC_CTRLE) This field defines the PTC clock relative to the peripheral clock according to the table below. Mask */
#define PTC_CTRLE_PRSC(value)                 (PTC_CTRLE_PRSC_Msk & (_UINT32_(value) << PTC_CTRLE_PRSC_Pos)) /* Assignment of value for PRSC in the PTC_CTRLE register */
#define PTC_CTRLE_WKUPEXP_Pos                 _UINT32_(12)                                         /* (PTC_CTRLE) Wake-Up Exponent Position */
#define PTC_CTRLE_WKUPEXP_Msk                 (_UINT32_(0xF) << PTC_CTRLE_WKUPEXP_Pos)             /* (PTC_CTRLE) Wake-Up Exponent Mask */
#define PTC_CTRLE_WKUPEXP(value)              (PTC_CTRLE_WKUPEXP_Msk & (_UINT32_(value) << PTC_CTRLE_WKUPEXP_Pos)) /* Assignment of value for WKUPEXP in the PTC_CTRLE register */
#define PTC_CTRLE_Msk                         _UINT32_(0x0000F710)                                 /* (PTC_CTRLE) Register Mask  */


/* -------- PTC_SWTRIG : (PTC Offset: 0x1C) (R/W 32) Software Trigger Register -------- */
#define PTC_SWTRIG_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_SWTRIG) Software Trigger Register  Reset Value */

