Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/ptc.h
#define PTC_SWTRIG_STCONV_Pos                 _UINT32_(0)                                          /* (PTC_SWTRIG) Start Conversion Position */
#define PTC_SWTRIG_STCONV_Msk                 (_UINT32_(0x1) << PTC_SWTRIG_STCONV_Pos)             /* (PTC_SWTRIG) Start Conversion Mask */
#define PTC_SWTRIG_STCONV(value)              (PTC_SWTRIG_STCONV_Msk & (_UINT32_(value) << PTC_SWTRIG_STCONV_Pos)) /* Assignment of value for STCONV in the PTC_SWTRIG register */
#define PTC_SWTRIG_Msk                        _UINT32_(0x00000001)                                 /* (PTC_SWTRIG) Register Mask  */


/* -------- PTC_WINLT : (PTC Offset: 0x20) (R/W 32) Window Comparator Low Threshold Register -------- */
#define PTC_WINLT_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_WINLT) Window Comparator Low Threshold Register  Reset Value */

#define PTC_WINLT_WCLT_Pos                    _UINT32_(0)                                          /* (PTC_WINLT) Window Comparator Low Threshold Position */
#define PTC_WINLT_WCLT_Msk                    (_UINT32_(0xFFFF) << PTC_WINLT_WCLT_Pos)             /* (PTC_WINLT) Window Comparator Low Threshold Mask */
#define PTC_WINLT_WCLT(value)                 (PTC_WINLT_WCLT_Msk & (_UINT32_(value) << PTC_WINLT_WCLT_Pos)) /* Assignment of value for WCLT in the PTC_WINLT register */
#define PTC_WINLT_Msk                         _UINT32_(0x0000FFFF)                                 /* (PTC_WINLT) Register Mask  */


/* -------- PTC_WINHT : (PTC Offset: 0x24) (R/W 32) Window Comparator High Threshold Register -------- */
#define PTC_WINHT_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_WINHT) Window Comparator High Threshold Register  Reset Value */

#define PTC_WINHT_WCHT_Pos                    _UINT32_(0)                                          /* (PTC_WINHT) Window Comparator High Threshold Position */
#define PTC_WINHT_WCHT_Msk                    (_UINT32_(0xFFFF) << PTC_WINHT_WCHT_Pos)             /* (PTC_WINHT) Window Comparator High Threshold Mask */
#define PTC_WINHT_WCHT(value)                 (PTC_WINHT_WCHT_Msk & (_UINT32_(value) << PTC_WINHT_WCHT_Pos)) /* Assignment of value for WCHT in the PTC_WINHT register */
#define PTC_WINHT_Msk                         _UINT32_(0x0000FFFF)                                 /* (PTC_WINHT) Register Mask  */


/* -------- PTC_PINEN1 : (PTC Offset: 0x28) (R/W 32) PTC Line Enable 1 Register -------- */
#define PTC_PINEN1_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_PINEN1) PTC Line Enable 1 Register  Reset Value */

#define PTC_PINEN1_PINEN_Pos                  _UINT32_(0)                                          /* (PTC_PINEN1) PTC-Line 31-0 Enable Position */
#define PTC_PINEN1_PINEN_Msk                  (_UINT32_(0xFFFFFFFF) << PTC_PINEN1_PINEN_Pos)       /* (PTC_PINEN1) PTC-Line 31-0 Enable Mask */
#define PTC_PINEN1_PINEN(value)               (PTC_PINEN1_PINEN_Msk & (_UINT32_(value) << PTC_PINEN1_PINEN_Pos)) /* Assignment of value for PINEN in the PTC_PINEN1 register */
#define PTC_PINEN1_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (PTC_PINEN1) Register Mask  */


/* -------- PTC_PINEN2 : (PTC Offset: 0x2C) (R/W 32) PTC Line Enable 2 Register -------- */
#define PTC_PINEN2_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_PINEN2) PTC Line Enable 2 Register  Reset Value */

#define PTC_PINEN2_PINEN_Pos                  _UINT32_(0)                                          /* (PTC_PINEN2) PTC-Line 63-32 Enable Position */
#define PTC_PINEN2_PINEN_Msk                  (_UINT32_(0xF) << PTC_PINEN2_PINEN_Pos)              /* (PTC_PINEN2) PTC-Line 63-32 Enable Mask */
#define PTC_PINEN2_PINEN(value)               (PTC_PINEN2_PINEN_Msk & (_UINT32_(value) << PTC_PINEN2_PINEN_Pos)) /* Assignment of value for PINEN in the PTC_PINEN2 register */
#define PTC_PINEN2_Msk                        _UINT32_(0x0000000F)                                 /* (PTC_PINEN2) Register Mask  */


/* -------- PTC_XSEL1 : (PTC Offset: 0x30) (R/W 32) X Line Selection 1 Register -------- */
#define PTC_XSEL1_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_XSEL1) X Line Selection 1 Register  Reset Value */

#define PTC_XSEL1_XSEL_Pos                    _UINT32_(0)                                          /* (PTC_XSEL1) X-Line Selection [31:0] Position */
#define PTC_XSEL1_XSEL_Msk                    (_UINT32_(0xFFFFFFFF) << PTC_XSEL1_XSEL_Pos)         /* (PTC_XSEL1) X-Line Selection [31:0] Mask */
#define PTC_XSEL1_XSEL(value)                 (PTC_XSEL1_XSEL_Msk & (_UINT32_(value) << PTC_XSEL1_XSEL_Pos)) /* Assignment of value for XSEL in the PTC_XSEL1 register */
#define PTC_XSEL1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PTC_XSEL1) Register Mask  */


/* -------- PTC_XSEL2 : (PTC Offset: 0x34) (R/W 32) X Line Selection 2 Register -------- */
#define PTC_XSEL2_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_XSEL2) X Line Selection 2 Register  Reset Value */

#define PTC_XSEL2_XSEL_Pos                    _UINT32_(0)                                          /* (PTC_XSEL2) X-Line Selection [63:32] Position */
#define PTC_XSEL2_XSEL_Msk                    (_UINT32_(0xF) << PTC_XSEL2_XSEL_Pos)                /* (PTC_XSEL2) X-Line Selection [63:32] Mask */
#define PTC_XSEL2_XSEL(value)                 (PTC_XSEL2_XSEL_Msk & (_UINT32_(value) << PTC_XSEL2_XSEL_Pos)) /* Assignment of value for XSEL in the PTC_XSEL2 register */
#define PTC_XSEL2_Msk                         _UINT32_(0x0000000F)                                 /* (PTC_XSEL2) Register Mask  */


/* -------- PTC_YSEL1 : (PTC Offset: 0x38) (R/W 32) Y Line Selection 1 Register -------- */
#define PTC_YSEL1_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_YSEL1) Y Line Selection 1 Register  Reset Value */

#define PTC_YSEL1_YSEL_Pos                    _UINT32_(0)                                          /* (PTC_YSEL1) Y-Line Selection [31:0] Position */
#define PTC_YSEL1_YSEL_Msk                    (_UINT32_(0xFFFFFFFF) << PTC_YSEL1_YSEL_Pos)         /* (PTC_YSEL1) Y-Line Selection [31:0] Mask */
#define PTC_YSEL1_YSEL(value)                 (PTC_YSEL1_YSEL_Msk & (_UINT32_(value) << PTC_YSEL1_YSEL_Pos)) /* Assignment of value for YSEL in the PTC_YSEL1 register */
#define PTC_YSEL1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PTC_YSEL1) Register Mask  */


/* -------- PTC_YSEL2 : (PTC Offset: 0x3C) (R/W 32) Y Line Selection 2 Register -------- */
#define PTC_YSEL2_RESETVALUE                  _UINT32_(0x00)                                       /*  (PTC_YSEL2) Y Line Selection 2 Register  Reset Value */

