Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/ptc.h
/* -------- PTC_SYNCBUSY : (PTC Offset: 0x5C) ( R/ 32) Synchronization Register -------- */
#define PTC_SYNCBUSY_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_SYNCBUSY) Synchronization Register  Reset Value */

#define PTC_SYNCBUSY_SWRST_Pos                _UINT32_(0)                                          /* (PTC_SYNCBUSY) SWRST Synchronization Busy --- Synchronizing Busy bit for swrst Position */
#define PTC_SYNCBUSY_SWRST_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_SWRST_Pos)            /* (PTC_SYNCBUSY) SWRST Synchronization Busy --- Synchronizing Busy bit for swrst Mask */
#define PTC_SYNCBUSY_SWRST(value)             (PTC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << PTC_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_ENABLE_Pos               _UINT32_(1)                                          /* (PTC_SYNCBUSY) ENABLE Synchronization Busy Position */
#define PTC_SYNCBUSY_ENABLE_Msk               (_UINT32_(0x1) << PTC_SYNCBUSY_ENABLE_Pos)           /* (PTC_SYNCBUSY) ENABLE Synchronization Busy Mask */
#define PTC_SYNCBUSY_ENABLE(value)            (PTC_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << PTC_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_CTRLB_Pos                _UINT32_(2)                                          /* (PTC_SYNCBUSY) Control B Synchronization Busy Position */
#define PTC_SYNCBUSY_CTRLB_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_CTRLB_Pos)            /* (PTC_SYNCBUSY) Control B Synchronization Busy Mask */
#define PTC_SYNCBUSY_CTRLB(value)             (PTC_SYNCBUSY_CTRLB_Msk & (_UINT32_(value) << PTC_SYNCBUSY_CTRLB_Pos)) /* Assignment of value for CTRLB in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_CTRLC_Pos                _UINT32_(3)                                          /* (PTC_SYNCBUSY) Control C Synchronization Busy Position */
#define PTC_SYNCBUSY_CTRLC_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_CTRLC_Pos)            /* (PTC_SYNCBUSY) Control C Synchronization Busy Mask */
#define PTC_SYNCBUSY_CTRLC(value)             (PTC_SYNCBUSY_CTRLC_Msk & (_UINT32_(value) << PTC_SYNCBUSY_CTRLC_Pos)) /* Assignment of value for CTRLC in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_CTRLD_Pos                _UINT32_(4)                                          /* (PTC_SYNCBUSY) Control D Synchronization Busy Position */
#define PTC_SYNCBUSY_CTRLD_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_CTRLD_Pos)            /* (PTC_SYNCBUSY) Control D Synchronization Busy Mask */
#define PTC_SYNCBUSY_CTRLD(value)             (PTC_SYNCBUSY_CTRLD_Msk & (_UINT32_(value) << PTC_SYNCBUSY_CTRLD_Pos)) /* Assignment of value for CTRLD in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_SWTRIG_Pos               _UINT32_(5)                                          /* (PTC_SYNCBUSY) Software Trigger Synchronization Busy Position */
#define PTC_SYNCBUSY_SWTRIG_Msk               (_UINT32_(0x1) << PTC_SYNCBUSY_SWTRIG_Pos)           /* (PTC_SYNCBUSY) Software Trigger Synchronization Busy Mask */
#define PTC_SYNCBUSY_SWTRIG(value)            (PTC_SYNCBUSY_SWTRIG_Msk & (_UINT32_(value) << PTC_SYNCBUSY_SWTRIG_Pos)) /* Assignment of value for SWTRIG in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_WINLT_Pos                _UINT32_(6)                                          /* (PTC_SYNCBUSY) Window Comparator Low Threshold Synchronization Busy Position */
#define PTC_SYNCBUSY_WINLT_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_WINLT_Pos)            /* (PTC_SYNCBUSY) Window Comparator Low Threshold Synchronization Busy Mask */
#define PTC_SYNCBUSY_WINLT(value)             (PTC_SYNCBUSY_WINLT_Msk & (_UINT32_(value) << PTC_SYNCBUSY_WINLT_Pos)) /* Assignment of value for WINLT in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_WINHT_Pos                _UINT32_(7)                                          /* (PTC_SYNCBUSY) Window Comparator High Threshold Synchronization Busy Position */
#define PTC_SYNCBUSY_WINHT_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_WINHT_Pos)            /* (PTC_SYNCBUSY) Window Comparator High Threshold Synchronization Busy Mask */
#define PTC_SYNCBUSY_WINHT(value)             (PTC_SYNCBUSY_WINHT_Msk & (_UINT32_(value) << PTC_SYNCBUSY_WINHT_Pos)) /* Assignment of value for WINHT in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_XSEL1_Pos                _UINT32_(8)                                          /* (PTC_SYNCBUSY) X-lines Selection 1 Synchronization Busy Position */
#define PTC_SYNCBUSY_XSEL1_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_XSEL1_Pos)            /* (PTC_SYNCBUSY) X-lines Selection 1 Synchronization Busy Mask */
#define PTC_SYNCBUSY_XSEL1(value)             (PTC_SYNCBUSY_XSEL1_Msk & (_UINT32_(value) << PTC_SYNCBUSY_XSEL1_Pos)) /* Assignment of value for XSEL1 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_XSEL2_Pos                _UINT32_(9)                                          /* (PTC_SYNCBUSY) X-lines Selection 2 Synchronization Busy Position */
#define PTC_SYNCBUSY_XSEL2_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_XSEL2_Pos)            /* (PTC_SYNCBUSY) X-lines Selection 2 Synchronization Busy Mask */
#define PTC_SYNCBUSY_XSEL2(value)             (PTC_SYNCBUSY_XSEL2_Msk & (_UINT32_(value) << PTC_SYNCBUSY_XSEL2_Pos)) /* Assignment of value for XSEL2 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_YSEL1_Pos                _UINT32_(10)                                         /* (PTC_SYNCBUSY) Y-lines Selection 1 Synchronization Busy Position */
#define PTC_SYNCBUSY_YSEL1_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_YSEL1_Pos)            /* (PTC_SYNCBUSY) Y-lines Selection 1 Synchronization Busy Mask */
#define PTC_SYNCBUSY_YSEL1(value)             (PTC_SYNCBUSY_YSEL1_Msk & (_UINT32_(value) << PTC_SYNCBUSY_YSEL1_Pos)) /* Assignment of value for YSEL1 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_YSEL2_Pos                _UINT32_(11)                                         /* (PTC_SYNCBUSY) Y-lines Selection 2 Synchronization Busy Position */
#define PTC_SYNCBUSY_YSEL2_Msk                (_UINT32_(0x1) << PTC_SYNCBUSY_YSEL2_Pos)            /* (PTC_SYNCBUSY) Y-lines Selection 2 Synchronization Busy Mask */
#define PTC_SYNCBUSY_YSEL2(value)             (PTC_SYNCBUSY_YSEL2_Msk & (_UINT32_(value) << PTC_SYNCBUSY_YSEL2_Pos)) /* Assignment of value for YSEL2 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_POLCTRL1_Pos             _UINT32_(12)                                         /* (PTC_SYNCBUSY) Polarity Control 1 Synchronization Busy Position */
#define PTC_SYNCBUSY_POLCTRL1_Msk             (_UINT32_(0x1) << PTC_SYNCBUSY_POLCTRL1_Pos)         /* (PTC_SYNCBUSY) Polarity Control 1 Synchronization Busy Mask */
#define PTC_SYNCBUSY_POLCTRL1(value)          (PTC_SYNCBUSY_POLCTRL1_Msk & (_UINT32_(value) << PTC_SYNCBUSY_POLCTRL1_Pos)) /* Assignment of value for POLCTRL1 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_POLCTRL2_Pos             _UINT32_(13)                                         /* (PTC_SYNCBUSY) Polarity Control 2 Synchronization Busy Position */
#define PTC_SYNCBUSY_POLCTRL2_Msk             (_UINT32_(0x1) << PTC_SYNCBUSY_POLCTRL2_Pos)         /* (PTC_SYNCBUSY) Polarity Control 2 Synchronization Busy Mask */
#define PTC_SYNCBUSY_POLCTRL2(value)          (PTC_SYNCBUSY_POLCTRL2_Msk & (_UINT32_(value) << PTC_SYNCBUSY_POLCTRL2_Pos)) /* Assignment of value for POLCTRL2 in the PTC_SYNCBUSY register */
#define PTC_SYNCBUSY_Msk                      _UINT32_(0x00003FFF)                                 /* (PTC_SYNCBUSY) Register Mask  */

#define PTC_SYNCBUSY_XSEL_Pos                 _UINT32_(8)                                          /* (PTC_SYNCBUSY Position) X-lines Selection x Synchronization Busy */
#define PTC_SYNCBUSY_XSEL_Msk                 (_UINT32_(0x3) << PTC_SYNCBUSY_XSEL_Pos)             /* (PTC_SYNCBUSY Mask) XSEL */
#define PTC_SYNCBUSY_XSEL(value)              (PTC_SYNCBUSY_XSEL_Msk & (_UINT32_(value) << PTC_SYNCBUSY_XSEL_Pos)) 
#define PTC_SYNCBUSY_YSEL_Pos                 _UINT32_(10)                                         /* (PTC_SYNCBUSY Position) Y-lines Selection x Synchronization Busy */
#define PTC_SYNCBUSY_YSEL_Msk                 (_UINT32_(0x3) << PTC_SYNCBUSY_YSEL_Pos)             /* (PTC_SYNCBUSY Mask) YSEL */
#define PTC_SYNCBUSY_YSEL(value)              (PTC_SYNCBUSY_YSEL_Msk & (_UINT32_(value) << PTC_SYNCBUSY_YSEL_Pos)) 
#define PTC_SYNCBUSY_POLCTRL_Pos              _UINT32_(12)                                         /* (PTC_SYNCBUSY Position) Polarity Control 2 Synchronization Busy */
#define PTC_SYNCBUSY_POLCTRL_Msk              (_UINT32_(0x3) << PTC_SYNCBUSY_POLCTRL_Pos)          /* (PTC_SYNCBUSY Mask) POLCTRL */
#define PTC_SYNCBUSY_POLCTRL(value)           (PTC_SYNCBUSY_POLCTRL_Msk & (_UINT32_(value) << PTC_SYNCBUSY_POLCTRL_Pos)) 

/* -------- PTC_DSEQCTRL : (PTC Offset: 0x60) (R/W 32) DMA SEQUENCE CTRL Register -------- */
#define PTC_DSEQCTRL_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_DSEQCTRL) DMA SEQUENCE CTRL Register  Reset Value */

#define PTC_DSEQCTRL_CTRLD_Pos                _UINT32_(0)                                          /* (PTC_DSEQCTRL) Control D. Position */
#define PTC_DSEQCTRL_CTRLD_Msk                (_UINT32_(0x1) << PTC_DSEQCTRL_CTRLD_Pos)            /* (PTC_DSEQCTRL) Control D. Mask */
#define PTC_DSEQCTRL_CTRLD(value)             (PTC_DSEQCTRL_CTRLD_Msk & (_UINT32_(value) << PTC_DSEQCTRL_CTRLD_Pos)) /* Assignment of value for CTRLD in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_WINLT_Pos                _UINT32_(1)                                          /* (PTC_DSEQCTRL) Window Comparator Low Threshold Position */
#define PTC_DSEQCTRL_WINLT_Msk                (_UINT32_(0x1) << PTC_DSEQCTRL_WINLT_Pos)            /* (PTC_DSEQCTRL) Window Comparator Low Threshold Mask */
#define PTC_DSEQCTRL_WINLT(value)             (PTC_DSEQCTRL_WINLT_Msk & (_UINT32_(value) << PTC_DSEQCTRL_WINLT_Pos)) /* Assignment of value for WINLT in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_WINHT_Pos                _UINT32_(2)                                          /* (PTC_DSEQCTRL) Window Comparator High Threshold Position */
#define PTC_DSEQCTRL_WINHT_Msk                (_UINT32_(0x1) << PTC_DSEQCTRL_WINHT_Pos)            /* (PTC_DSEQCTRL) Window Comparator High Threshold Mask */
#define PTC_DSEQCTRL_WINHT(value)             (PTC_DSEQCTRL_WINHT_Msk & (_UINT32_(value) << PTC_DSEQCTRL_WINHT_Pos)) /* Assignment of value for WINHT in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_XSEL_Pos                 _UINT32_(3)                                          /* (PTC_DSEQCTRL) X-line n Selection lower/upper half word Position */
#define PTC_DSEQCTRL_XSEL_Msk                 (_UINT32_(0xF) << PTC_DSEQCTRL_XSEL_Pos)             /* (PTC_DSEQCTRL) X-line n Selection lower/upper half word Mask */
#define PTC_DSEQCTRL_XSEL(value)              (PTC_DSEQCTRL_XSEL_Msk & (_UINT32_(value) << PTC_DSEQCTRL_XSEL_Pos)) /* Assignment of value for XSEL in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_YSEL_Pos                 _UINT32_(7)                                          /* (PTC_DSEQCTRL) Y-line n Selection lower/uper half word Position */
#define PTC_DSEQCTRL_YSEL_Msk                 (_UINT32_(0xF) << PTC_DSEQCTRL_YSEL_Pos)             /* (PTC_DSEQCTRL) Y-line n Selection lower/uper half word Mask */
#define PTC_DSEQCTRL_YSEL(value)              (PTC_DSEQCTRL_YSEL_Msk & (_UINT32_(value) << PTC_DSEQCTRL_YSEL_Pos)) /* Assignment of value for YSEL in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_POL_Pos                  _UINT32_(11)                                         /* (PTC_DSEQCTRL) Polarity n lower/upper half word Position */
#define PTC_DSEQCTRL_POL_Msk                  (_UINT32_(0xF) << PTC_DSEQCTRL_POL_Pos)              /* (PTC_DSEQCTRL) Polarity n lower/upper half word Mask */
#define PTC_DSEQCTRL_POL(value)               (PTC_DSEQCTRL_POL_Msk & (_UINT32_(value) << PTC_DSEQCTRL_POL_Pos)) /* Assignment of value for POL in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_CC_Pos                   _UINT32_(15)                                         /* (PTC_DSEQCTRL) Compensation Capacitor Position */
#define PTC_DSEQCTRL_CC_Msk                   (_UINT32_(0x1) << PTC_DSEQCTRL_CC_Pos)               /* (PTC_DSEQCTRL) Compensation Capacitor Mask */
#define PTC_DSEQCTRL_CC(value)                (PTC_DSEQCTRL_CC_Msk & (_UINT32_(value) << PTC_DSEQCTRL_CC_Pos)) /* Assignment of value for CC in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_CI_Pos                   _UINT32_(16)                                         /* (PTC_DSEQCTRL) Integration Capacitor Position */
#define PTC_DSEQCTRL_CI_Msk                   (_UINT32_(0x1) << PTC_DSEQCTRL_CI_Pos)               /* (PTC_DSEQCTRL) Integration Capacitor Mask */
#define PTC_DSEQCTRL_CI(value)                (PTC_DSEQCTRL_CI_Msk & (_UINT32_(value) << PTC_DSEQCTRL_CI_Pos)) /* Assignment of value for CI in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_CSD_Pos                  _UINT32_(17)                                         /* (PTC_DSEQCTRL) Charge Share Delay Position */
#define PTC_DSEQCTRL_CSD_Msk                  (_UINT32_(0x1) << PTC_DSEQCTRL_CSD_Pos)              /* (PTC_DSEQCTRL) Charge Share Delay Mask */
#define PTC_DSEQCTRL_CSD(value)               (PTC_DSEQCTRL_CSD_Msk & (_UINT32_(value) << PTC_DSEQCTRL_CSD_Pos)) /* Assignment of value for CSD in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_AUTOSTART_Pos            _UINT32_(31)                                         /* (PTC_DSEQCTRL) PTC Auto-Start Conversion. Position */
#define PTC_DSEQCTRL_AUTOSTART_Msk            (_UINT32_(0x1) << PTC_DSEQCTRL_AUTOSTART_Pos)        /* (PTC_DSEQCTRL) PTC Auto-Start Conversion. Mask */
#define PTC_DSEQCTRL_AUTOSTART(value)         (PTC_DSEQCTRL_AUTOSTART_Msk & (_UINT32_(value) << PTC_DSEQCTRL_AUTOSTART_Pos)) /* Assignment of value for AUTOSTART in the PTC_DSEQCTRL register */
#define PTC_DSEQCTRL_Msk                      _UINT32_(0x8003FFFF)                                 /* (PTC_DSEQCTRL) Register Mask  */


/* -------- PTC_DSEQSTAT : (PTC Offset: 0x64) ( R/ 32) DMA SEQUENCE STATUS - Register -------- */
#define PTC_DSEQSTAT_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_DSEQSTAT) DMA SEQUENCE STATUS - Register  Reset Value */

#define PTC_DSEQSTAT_CTRLD_Pos                _UINT32_(0)                                          /* (PTC_DSEQSTAT) Control D. Position */
#define PTC_DSEQSTAT_CTRLD_Msk                (_UINT32_(0x1) << PTC_DSEQSTAT_CTRLD_Pos)            /* (PTC_DSEQSTAT) Control D. Mask */
#define PTC_DSEQSTAT_CTRLD(value)             (PTC_DSEQSTAT_CTRLD_Msk & (_UINT32_(value) << PTC_DSEQSTAT_CTRLD_Pos)) /* Assignment of value for CTRLD in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_WINLT_Pos                _UINT32_(1)                                          /* (PTC_DSEQSTAT) Window Comparator Low Threshold Position */
#define PTC_DSEQSTAT_WINLT_Msk                (_UINT32_(0x1) << PTC_DSEQSTAT_WINLT_Pos)            /* (PTC_DSEQSTAT) Window Comparator Low Threshold Mask */
#define PTC_DSEQSTAT_WINLT(value)             (PTC_DSEQSTAT_WINLT_Msk & (_UINT32_(value) << PTC_DSEQSTAT_WINLT_Pos)) /* Assignment of value for WINLT in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_WINHT_Pos                _UINT32_(2)                                          /* (PTC_DSEQSTAT) Window Comparator High Threshold Position */
#define PTC_DSEQSTAT_WINHT_Msk                (_UINT32_(0x1) << PTC_DSEQSTAT_WINHT_Pos)            /* (PTC_DSEQSTAT) Window Comparator High Threshold Mask */
#define PTC_DSEQSTAT_WINHT(value)             (PTC_DSEQSTAT_WINHT_Msk & (_UINT32_(value) << PTC_DSEQSTAT_WINHT_Pos)) /* Assignment of value for WINHT in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_XSEL_Pos                 _UINT32_(3)                                          /* (PTC_DSEQSTAT) X-line n  Selection lower/upper half word Position */
#define PTC_DSEQSTAT_XSEL_Msk                 (_UINT32_(0xF) << PTC_DSEQSTAT_XSEL_Pos)             /* (PTC_DSEQSTAT) X-line n  Selection lower/upper half word Mask */
#define PTC_DSEQSTAT_XSEL(value)              (PTC_DSEQSTAT_XSEL_Msk & (_UINT32_(value) << PTC_DSEQSTAT_XSEL_Pos)) /* Assignment of value for XSEL in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_YSEL_Pos                 _UINT32_(7)                                          /* (PTC_DSEQSTAT) Y-line n Selection lower/upper half word Position */
#define PTC_DSEQSTAT_YSEL_Msk                 (_UINT32_(0xF) << PTC_DSEQSTAT_YSEL_Pos)             /* (PTC_DSEQSTAT) Y-line n Selection lower/upper half word Mask */
#define PTC_DSEQSTAT_YSEL(value)              (PTC_DSEQSTAT_YSEL_Msk & (_UINT32_(value) << PTC_DSEQSTAT_YSEL_Pos)) /* Assignment of value for YSEL in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_POL_Pos                  _UINT32_(11)                                         /* (PTC_DSEQSTAT) Polarity n lower/upper half word Position */
#define PTC_DSEQSTAT_POL_Msk                  (_UINT32_(0xF) << PTC_DSEQSTAT_POL_Pos)              /* (PTC_DSEQSTAT) Polarity n lower/upper half word Mask */
#define PTC_DSEQSTAT_POL(value)               (PTC_DSEQSTAT_POL_Msk & (_UINT32_(value) << PTC_DSEQSTAT_POL_Pos)) /* Assignment of value for POL in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_CC_Pos                   _UINT32_(15)                                         /* (PTC_DSEQSTAT) Compensation Capacitor Position */
#define PTC_DSEQSTAT_CC_Msk                   (_UINT32_(0x1) << PTC_DSEQSTAT_CC_Pos)               /* (PTC_DSEQSTAT) Compensation Capacitor Mask */
#define PTC_DSEQSTAT_CC(value)                (PTC_DSEQSTAT_CC_Msk & (_UINT32_(value) << PTC_DSEQSTAT_CC_Pos)) /* Assignment of value for CC in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_CI_Pos                   _UINT32_(16)                                         /* (PTC_DSEQSTAT) Integration Capacitor Position */
#define PTC_DSEQSTAT_CI_Msk                   (_UINT32_(0x1) << PTC_DSEQSTAT_CI_Pos)               /* (PTC_DSEQSTAT) Integration Capacitor Mask */
#define PTC_DSEQSTAT_CI(value)                (PTC_DSEQSTAT_CI_Msk & (_UINT32_(value) << PTC_DSEQSTAT_CI_Pos)) /* Assignment of value for CI in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_CSD_Pos                  _UINT32_(17)                                         /* (PTC_DSEQSTAT) Charge Share Delay Position */
#define PTC_DSEQSTAT_CSD_Msk                  (_UINT32_(0x1) << PTC_DSEQSTAT_CSD_Pos)              /* (PTC_DSEQSTAT) Charge Share Delay Mask */
#define PTC_DSEQSTAT_CSD(value)               (PTC_DSEQSTAT_CSD_Msk & (_UINT32_(value) << PTC_DSEQSTAT_CSD_Pos)) /* Assignment of value for CSD in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_BUSY_Pos                 _UINT32_(31)                                         /* (PTC_DSEQSTAT) Sequencing Busy Position */
#define PTC_DSEQSTAT_BUSY_Msk                 (_UINT32_(0x1) << PTC_DSEQSTAT_BUSY_Pos)             /* (PTC_DSEQSTAT) Sequencing Busy Mask */
#define PTC_DSEQSTAT_BUSY(value)              (PTC_DSEQSTAT_BUSY_Msk & (_UINT32_(value) << PTC_DSEQSTAT_BUSY_Pos)) /* Assignment of value for BUSY in the PTC_DSEQSTAT register */
#define PTC_DSEQSTAT_Msk                      _UINT32_(0x8003FFFF)                                 /* (PTC_DSEQSTAT) Register Mask  */


/* -------- PTC_DSEQDATA : (PTC Offset: 0x68) ( /W 32) DMA SEQUENCE DATA - Register -------- */
#define PTC_DSEQDATA_RESETVALUE               _UINT32_(0x00)                                       /*  (PTC_DSEQDATA) DMA SEQUENCE DATA - Register  Reset Value */

#define PTC_DSEQDATA_DATA_Pos                 _UINT32_(0)                                          /* (PTC_DSEQDATA) DMA Sequential Data. Position */
#define PTC_DSEQDATA_DATA_Msk                 (_UINT32_(0xFFFFFFFF) << PTC_DSEQDATA_DATA_Pos)      /* (PTC_DSEQDATA) DMA Sequential Data. Mask */
#define PTC_DSEQDATA_DATA(value)              (PTC_DSEQDATA_DATA_Msk & (_UINT32_(value) << PTC_DSEQDATA_DATA_Pos)) /* Assignment of value for DATA in the PTC_DSEQDATA register */
#define PTC_DSEQDATA_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (PTC_DSEQDATA) Register Mask  */


/* -------- PTC_RESULT : (PTC Offset: 0x6C) ( R/ 32) Register -------- */
#define PTC_RESULT_RESETVALUE                 _UINT32_(0x00)                                       /*  (PTC_RESULT) Register  Reset Value */

#define PTC_RESULT_RES_Pos                    _UINT32_(0)                                          /* (PTC_RESULT) Result Conversion Value. Position */
#define PTC_RESULT_RES_Msk                    (_UINT32_(0xFFF) << PTC_RESULT_RES_Pos)              /* (PTC_RESULT) Result Conversion Value. Mask */
#define PTC_RESULT_RES(value)                 (PTC_RESULT_RES_Msk & (_UINT32_(value) << PTC_RESULT_RES_Pos)) /* Assignment of value for RES in the PTC_RESULT register */
#define PTC_RESULT_ACCRES_Pos                 _UINT32_(16)                                         /* (PTC_RESULT) Accumulated Result Conversion Value. Position */
#define PTC_RESULT_ACCRES_Msk                 (_UINT32_(0xFFFF) << PTC_RESULT_ACCRES_Pos)          /* (PTC_RESULT) Accumulated Result Conversion Value. Mask */
#define PTC_RESULT_ACCRES(value)              (PTC_RESULT_ACCRES_Msk & (_UINT32_(value) << PTC_RESULT_ACCRES_Pos)) /* Assignment of value for ACCRES in the PTC_RESULT register */
#define PTC_RESULT_Msk                        _UINT32_(0xFFFF0FFF)                                 /* (PTC_RESULT) Register Mask  */


