Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00_secure/src/packs/PIC32CM5112SG00100_DFP/component/ptc.h
/* PTC register offsets definitions */
#define PTC_CTRLA_REG_OFST             _UINT32_(0x00)      /* (PTC_CTRLA) CONTROL ENABLE REGISTER Offset */
#define PTC_EVCTRL_REG_OFST            _UINT32_(0x04)      /* (PTC_EVCTRL) EVENT CONTROL REGISTER Offset */
#define PTC_DBGCTRL_REG_OFST           _UINT32_(0x08)      /* (PTC_DBGCTRL) DEBUG CONTROL Register Offset */
#define PTC_CTRLB_REG_OFST             _UINT32_(0x0C)      /* (PTC_CTRLB) CONTROL B Register Offset */
#define PTC_CTRLC_REG_OFST             _UINT32_(0x10)      /* (PTC_CTRLC) CONTROL C Register Offset */
#define PTC_CTRLD_REG_OFST             _UINT32_(0x14)      /* (PTC_CTRLD) CONTROL D Register Offset */
#define PTC_CTRLE_REG_OFST             _UINT32_(0x18)      /* (PTC_CTRLE) CONTROL E REGISTER Offset */
#define PTC_SWTRIG_REG_OFST            _UINT32_(0x1C)      /* (PTC_SWTRIG) Software Trigger Register Offset */
#define PTC_WINLT_REG_OFST             _UINT32_(0x20)      /* (PTC_WINLT) Window Comparator Low Threshold Register Offset */
#define PTC_WINHT_REG_OFST             _UINT32_(0x24)      /* (PTC_WINHT) Window Comparator High Threshold Register Offset */
#define PTC_PINEN1_REG_OFST            _UINT32_(0x28)      /* (PTC_PINEN1) PTC Line Enable 1 Register Offset */
#define PTC_PINEN2_REG_OFST            _UINT32_(0x2C)      /* (PTC_PINEN2) PTC Line Enable 2 Register Offset */
#define PTC_XSEL1_REG_OFST             _UINT32_(0x30)      /* (PTC_XSEL1) X Line Selection 1 Register Offset */
#define PTC_XSEL2_REG_OFST             _UINT32_(0x34)      /* (PTC_XSEL2) X Line Selection 2 Register Offset */
#define PTC_YSEL1_REG_OFST             _UINT32_(0x38)      /* (PTC_YSEL1) Y Line Selection 1 Register Offset */
#define PTC_YSEL2_REG_OFST             _UINT32_(0x3C)      /* (PTC_YSEL2) Y Line Selection 2 Register Offset */
#define PTC_POLCTRL1_REG_OFST          _UINT32_(0x40)      /* (PTC_POLCTRL1) Polarity Control 1 Register Offset */
#define PTC_POLCTRL2_REG_OFST          _UINT32_(0x44)      /* (PTC_POLCTRL2) Polarity Control 2 Register Offset */
#define PTC_INTENCLR_REG_OFST          _UINT32_(0x48)      /* (PTC_INTENCLR) INTERRUPT ENABLE CLEAR Register Offset */
#define PTC_INTENSET_REG_OFST          _UINT32_(0x4C)      /* (PTC_INTENSET) INTERRUPT ENABLE SET Register Offset */
#define PTC_INTFLAGSET_REG_OFST        _UINT32_(0x50)      /* (PTC_INTFLAGSET) INTERRUPT FLAG SET Register Offset */
#define PTC_INTFLAG_REG_OFST           _UINT32_(0x54)      /* (PTC_INTFLAG) INTERRUPT FLAG STATUS and CLEAR Register Offset */
#define PTC_STATUS_REG_OFST            _UINT32_(0x58)      /* (PTC_STATUS) STATUS Register Offset */
#define PTC_SYNCBUSY_REG_OFST          _UINT32_(0x5C)      /* (PTC_SYNCBUSY) Synchronization Register Offset */
#define PTC_DSEQCTRL_REG_OFST          _UINT32_(0x60)      /* (PTC_DSEQCTRL) DMA SEQUENCE CTRL Register Offset */
#define PTC_DSEQSTAT_REG_OFST          _UINT32_(0x64)      /* (PTC_DSEQSTAT) DMA SEQUENCE STATUS - Register Offset */
#define PTC_DSEQDATA_REG_OFST          _UINT32_(0x68)      /* (PTC_DSEQDATA) DMA SEQUENCE DATA - Register Offset */
#define PTC_RESULT_REG_OFST            _UINT32_(0x6C)      /* (PTC_RESULT) Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* PTC register API structure */
typedef struct
{  /* Polaris Peripheral Touch Controller */
  __IO  uint32_t                       PTC_CTRLA;          /* Offset: 0x00 (R/W  32) CONTROL ENABLE REGISTER */
  __IO  uint32_t                       PTC_EVCTRL;         /* Offset: 0x04 (R/W  32) EVENT CONTROL REGISTER */
  __IO  uint32_t                       PTC_DBGCTRL;        /* Offset: 0x08 (R/W  32) DEBUG CONTROL Register */
  __IO  uint32_t                       PTC_CTRLB;          /* Offset: 0x0C (R/W  32) CONTROL B Register */
  __IO  uint32_t                       PTC_CTRLC;          /* Offset: 0x10 (R/W  32) CONTROL C Register */
  __IO  uint32_t                       PTC_CTRLD;          /* Offset: 0x14 (R/W  32) CONTROL D Register */
  __IO  uint32_t                       PTC_CTRLE;          /* Offset: 0x18 (R/W  32) CONTROL E REGISTER */
  __IO  uint32_t                       PTC_SWTRIG;         /* Offset: 0x1C (R/W  32) Software Trigger Register */
  __IO  uint32_t                       PTC_WINLT;          /* Offset: 0x20 (R/W  32) Window Comparator Low Threshold Register */
  __IO  uint32_t                       PTC_WINHT;          /* Offset: 0x24 (R/W  32) Window Comparator High Threshold Register */
  __IO  uint32_t                       PTC_PINEN1;         /* Offset: 0x28 (R/W  32) PTC Line Enable 1 Register */
  __IO  uint32_t                       PTC_PINEN2;         /* Offset: 0x2C (R/W  32) PTC Line Enable 2 Register */
  __IO  uint32_t                       PTC_XSEL1;          /* Offset: 0x30 (R/W  32) X Line Selection 1 Register */
  __IO  uint32_t                       PTC_XSEL2;          /* Offset: 0x34 (R/W  32) X Line Selection 2 Register */
  __IO  uint32_t                       PTC_YSEL1;          /* Offset: 0x38 (R/W  32) Y Line Selection 1 Register */
  __IO  uint32_t                       PTC_YSEL2;          /* Offset: 0x3C (R/W  32) Y Line Selection 2 Register */
  __IO  uint32_t                       PTC_POLCTRL1;       /* Offset: 0x40 (R/W  32) Polarity Control 1 Register */
  __IO  uint32_t                       PTC_POLCTRL2;       /* Offset: 0x44 (R/W  32) Polarity Control 2 Register */
  __IO  uint32_t                       PTC_INTENCLR;       /* Offset: 0x48 (R/W  32) INTERRUPT ENABLE CLEAR Register */
  __IO  uint32_t                       PTC_INTENSET;       /* Offset: 0x4C (R/W  32) INTERRUPT ENABLE SET Register */
  __IO  uint32_t                       PTC_INTFLAGSET;     /* Offset: 0x50 (R/W  32) INTERRUPT FLAG SET Register */
  __IO  uint32_t                       PTC_INTFLAG;        /* Offset: 0x54 (R/W  32) INTERRUPT FLAG STATUS and CLEAR Register */
  __I   uint32_t                       PTC_STATUS;         /* Offset: 0x58 (R/   32) STATUS Register */
  __I   uint32_t                       PTC_SYNCBUSY;       /* Offset: 0x5C (R/   32) Synchronization Register */
  __IO  uint32_t                       PTC_DSEQCTRL;       /* Offset: 0x60 (R/W  32) DMA SEQUENCE CTRL Register */
  __I   uint32_t                       PTC_DSEQSTAT;       /* Offset: 0x64 (R/   32) DMA SEQUENCE STATUS - Register */
  __O   uint32_t                       PTC_DSEQDATA;       /* Offset: 0x68 ( /W  32) DMA SEQUENCE DATA - Register */
  __I   uint32_t                       PTC_RESULT;         /* Offset: 0x6C (R/   32) Register */
} ptc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CMSG00_PTC_COMPONENT_H_ */
